
## Plan Result

[CI link](https://github.com/ikigaikintore/ikigaikintore/actions/runs/7697849092)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 1 to change, 1 to destroy.</code></pre>

* Create
  * google_vpc_access_connector.internal-vpc-connector
* Update
  * google_artifact_registry_repository.artifact-repository
* Delete
  * google_compute_subnetwork.internal-vpc-subnet


<details><summary>Change Result (Click me)</summary>

```hcl

  # google_artifact_registry_repository.artifact-repository will be updated in-place
  ~ resource "google_artifact_registry_repository" "artifact-repository" {
        id               = "projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai"
        name             = "ikigai"
        # (10 unchanged attributes hidden)

      + docker_config {
          + immutable_tags = false
        }
    }

  # google_compute_subnetwork.internal-vpc-subnet will be destroyed
  # (because google_compute_subnetwork.internal-vpc-subnet is not in configuration)
  - resource "google_compute_subnetwork" "internal-vpc-subnet" {
      - creation_timestamp         = "2024-01-29T05:53:49.012-08:00" -> null
      - gateway_address            = "10.5.5.1" -> null
      - id                         = "projects/gig-japan-398904/regions/asia-northeast1/subnetworks/int-vpc-subnet" -> null
      - ip_cidr_range              = "10.5.5.0/24" -> null
      - name                       = "int-vpc-subnet" -> null
      - network                    = "https://www.googleapis.com/compute/v1/projects/gig-japan-398904/global/networks/int-vpc" -> null
      - private_ip_google_access   = true -> null
      - private_ipv6_google_access = "DISABLE_GOOGLE_ACCESS" -> null
      - project                    = "gig-japan-398904" -> null
      - purpose                    = "PRIVATE" -> null
      - region                     = "asia-northeast1" -> null
      - secondary_ip_range         = [] -> null
      - self_link                  = "https://www.googleapis.com/compute/v1/projects/gig-japan-398904/regions/asia-northeast1/subnetworks/int-vpc-subnet" -> null
      - stack_type                 = "IPV4_ONLY" -> null
    }

  # google_vpc_access_connector.internal-vpc-connector will be created
  + resource "google_vpc_access_connector" "internal-vpc-connector" {
      + connected_projects = (known after apply)
      + id                 = (known after apply)
      + ip_cidr_range      = "10.5.5.0/28"
      + machine_type       = "e2-micro"
      + max_instances      = 4
      + max_throughput     = 500
      + min_instances      = 2
      + min_throughput     = 200
      + name               = "vpc-connector"
      + network            = "projects/gig-japan-398904/global/networks/int-vpc"
      + project            = "gig-japan-398904"
      + region             = "asia-northeast1"
      + self_link          = (known after apply)
      + state              = (known after apply)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"summary_plan","PRNumber":39,"Program":"tfcmt","SHA1":"777abfea398f910363afeb13f4b2d5cbe3d61660","Vars":{},"WorkflowName":"iaac_plan"} -->